# Задание 1
# Необходимо вывести имена всех учеников из списка с новой строки

names = ['Оля', 'Петя', 'Вася', 'Маша']
for name in names:
    print(name)


# Задание 2
# Необходимо вывести имена всех учеников из списка, рядом с именем показать количество букв в нём
# Пример вывода:
# Оля: 3
# Петя: 4

names = ['Оля', 'Петя', 'Вася', 'Маша']
for name in names:
    l = len(name)
    print(f'{name} : {l}')

# Задание 3
# Необходимо вывести имена всех учеников из списка, рядом с именем вывести пол ученика

is_male = {
    'Оля': False,  # если False, то пол женский
    'Петя': True,  # если True, то пол мужской
    'Вася': True,
    'Маша': False,
}
names = ['Оля', 'Петя', 'Вася', 'Маша']
for name in is_male:
    if is_male.get(name) == False:
        print(name + ': Женский')
    else:
        print(name + ': Мужской')


# Задание 4
# Даны группу учеников. Нужно вывести количество групп и для каждой группы – количество учеников в ней
# Пример вывода:
# Всего 2 группы.
# Группа 1: 2 ученика.
# Группа 2: 4 ученика.

groups = [
    ['Вася', 'Маша'],
    ['Вася', 'Маша', 'Саша', 'Женя'],
    ['Оля', 'Петя', 'Гриша'],
]

number_of_groups = len(groups)
print(f'Всего {number_of_groups} групп.')
group_number = 0
for index, item in enumerate(groups): #здесь у меня проблема с номерами групп
    group_number += index
for group in groups:
    number_of_people = len(group)
    print(f'Группа {group_number}: {number_of_people} человек.')


# Задание 5
# Для каждой пары учеников нужно с новой строки перечислить учеников, которые в неё входят
# Пример вывода:
# Группа 1: Вася, Маша
# Группа 2: Оля, Петя, Гриша

groups = [
    ['Вася', 'Маша'],
    ['Вася', 'Маша', 'Саша', 'Женя'],
    ['Оля', 'Петя', 'Гриша'],
]

number_of_groups = len(groups)
print(f'Всего {number_of_groups} групп.')
group_number = 0
for index, item in enumerate(groups): #а здесь у меня проблема с номерами групп и с выводом списка
    group_number += index
    print(f'Группа {group_number}: {item}.')